docs/git.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>git</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org-default.css" />
</head>
<body>
<div id="content" class="container">
<nav aria-label="breadcrumb" style="--pico-nav-breadcrumb-divider: '|';" id="org0d17e30">
<ul class="org-ul">
<li><a href="index.html#ID-3a34d6d7-6f37-4573-b20e-3c93894e54ac">🏠</a></li>
<li><a href="site_map.html#ID-30ea5e38-9b41-4bcd-8631-76821e93e294">🗺</a></li>
</ul>
</nav>
<div id="outline-container-org4c5ae78" class="outline-2">
<h2 id="org4c5ae78">Git</h2>
<div class="outline-text-2" id="text-org4c5ae78">
</div>
<div id="outline-container-org0c66d7b" class="outline-3">
<h3 id="org0c66d7b">git notes</h3>
<div class="outline-text-3" id="text-org0c66d7b">
<ul class="org-ul">
<li><code>--depth</code> implies <code>single-branch</code> thus the refspec will be on single branch
<ul class="org-ul">
<li><code>git config remote.origin.fetch +refs/heads/*:refs/remotes/origin/*</code></li>
<li><code>git fetch --depth=1 origin "+refs/heads/*:refs/remotes/origin/*"</code></li>
<li><code>git fetch origin feature/branch --depth=1 &amp;&amp; git checkout -b feature/branch FETCH_HEAD</code></li>
<li><code>git notes add</code> stores notes that can be mailed with <code>git format-patch -n1 --notes</code> under the &#x2014;
<ul class="org-ul">
<li><code>git config notes.rewriteRef refs/notes/commits</code> to merge notes</li>
</ul></li>
<li><code>GIT_TRACE=1 git cmd</code> for debug</li>
</ul></li>
<li><code>git switch --orphan BRANCH_NAME</code> for empty branch</li>
<li><code>git rev-parse --show-object-format</code> sha1 or sha256 check
<ul class="org-ul">
<li>mostly unsupported by forges</li>
</ul></li>
<li>git bundle for offline repo backup
<ul class="org-ul">
<li><code>git -c 'pack.threads=1' bundle create -q My-BUNDLE --all</code> for deterministic bundles</li>
</ul></li>
<li><a href="https://git-scm.com/book/en/v2/Git-on-the-Server-The-Protocols#_dumb_http">https://git-scm.com/book/en/v2/Git-on-the-Server-The-Protocols#_dumb_http</a> for cloneable static file serving repo</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
